БухЭксп/DataProcessors/CW_СтандартныйОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_СтандартныйОбмен</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник_УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженоУспешно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСоответствия</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Синхронизация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник_Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник_УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник_Объект</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синхронизировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_УИД_Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_УИД_Владелец</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ_Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ_Владелец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолитикаСинхронизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПолитикаСинхронизацииОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданиеНового</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗаписан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СинхронизацияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СинхронизацияОбъектов</Name>
			<Comment>Синхронизация объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник_Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолитикаСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПолитикаСинхронизацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>флНезавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник_Идентификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Обмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник_УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник_СИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник_Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник_УИД</Name>
					<Comment>Уид бух. базы</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/DataProcessors/CW_СтандартныйОбмен/Forms/ФормаИнтерактивнойЗагрузки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработка = _сф.ст_ПолучитьСвойство(Параметры,"Объект");
	Обмен = _сф.ст_ПолучитьСвойство(Параметры,"Субъект");
	Если Обмен.Пустая() Тогда
		
		// не передали субъект
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	
	СтруктураНастроек = _ПО.ПолучитьНастройкиСубъекта(Обработка,Обмен);
	Настройки.Добавить(СтруктураНастроек);
	
	СтрПараметры = _сф.ст_Создать("Обмен,Синхросоответствие,СоответствиеТипов,ИспользуетсяUID,ОсновнойТипПеревозки");
	СтрПараметры.Обмен = Обмен;
	СтрПараметры.СинхроСоответствие = Новый Соответствие;
	СтрПараметры.СоответствиеТипов = _Объект().СоответствиеМетаданных();
	СтрПараметры.ИспользуетсяUID = Неопределено;
	СтрПараметры.ОсновнойТипПеревозки = _Настройка().Загрузка_ОсновнойТипПеревозки;
	
	ПараметрыЗагрузки.Очистить();
	ПараметрыЗагрузки.Добавить(СтрПараметры);
		
	// --- 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
	
	_ПрочитатьФайлыКаталога();
	
КонецПроцедуры


  

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	// --- 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _Настройка()
	// --- 
	
	Возврат(Настройки.Получить(0).Значение);
	
	// --- 
КонецФункции

&НаСервере
Функция _ПараметрыЗагрузки()
	// --- 
	
	Возврат(ПараметрыЗагрузки.Получить(0).Значение);
	
	// --- 
КонецФункции

&НаСервере
Функция _Объект()
	// --- 
	
	// только для функций не изменяющих данные !!!
	
	Возврат(РеквизитФормыВЗначение("Объект"));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборФайлаПродолжить(Команда)
	
	// проверяем, выбрана ли строка файла
	Если Элементы.Файлы.ТекущиеДанные <> Неопределено Тогда
		
		// пробуем прочитать файл
		Если _УФКС.ВыполненоУспешно(_ФайлВыбор(Элементы.Файлы.ТекущаяСтрока)) Тогда
			
			Если _УФКС.ВыполненоУспешно(_ПодготовитьТаблицыСинхронизации()) Тогда
				
				Элементы.СинхронизацияПродолжить.КнопкаПоУмолчанию=Истина;
				Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаСинхронизация;
				
			Иначе
				
				_УФК.ВывестиПредупреждение("Ошибка подготовки таблиц синхронизации");
				Возврат;
				
			КонецЕсли; 
			
		Иначе
			
			_УФК.ВывестиПредупреждение("Ошибка чтения файла.");
			Возврат;
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Необходимо выбрать файл");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура СинхронизацияНазад(Команда)
	
	Элементы.ВыборФайлаПродолжить.КнопкаПоУмолчанию=Истина;
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаВыборФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияПродолжить(Команда)
	
	Ответ = _ПроверитьСинхронизацию();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		// можно грузить
		//Элементы.ВыборФайлаПродолжить.КнопкаПоУмолчанию=Истина;
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаЗагрузка;
		Ответ = _ЗагрузитьОбъекты();
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Синхронизация объектов не закончена.");
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ПрочитатьФайлыКаталога()
	// --- 
	
	Каталог = Настройки.Получить(0).Значение.Загрузка_КаталогЗагрузкиФайлов;
	
	// ---
	
	Попытка
		
		ФайлыКаталога = НайтиФайлы(Каталог,"*.zip",Ложь);
		
	Исключение
		CW_Журнал.ЗаписатьСообщение("Обмен.МИС.Загрузка","error","Ошибка чтения файлов: "+ОписаниеОшибки());
	КонецПопытки;
	
	// --- 
	Файлы.Очистить();
	Для каждого Файл Из ФайлыКаталога Цикл
		
		Нстр = Файлы.Добавить();
		Нстр.ИмяФайла = Файл.Имя;
		Нстр.ПолноеИмяФайла = Файл.ПолноеИмя;
		
	КонецЦикла;

	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ФайлВыбор(ИдентификаторСтроки)
	// --- 
	
	СтрокаФайла = Файлы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ИмяФайла = СтрокаФайла.ПолноеИмяФайла;
	ЗагружаемыйФайл = ИмяФайла;
	// --- 
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ПрочитатьФайл(_ПараметрыЗагрузки(),ИмяФайла);
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	Возврат(Ответ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ПодготовитьТаблицыСинхронизации()
	// --- 
	
	Попытка
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Ответ = ОбработкаОбъект.СинхронизироватьПоРегистру(_ПараметрыЗагрузки());
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			Возврат(_УФКС.Ответ(1,"Ошибка синхронизации по регистру: "+_УФКС.ПредставлениеОшибки(Ответ)));
			
		Иначе
			
			ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
			
		КонецЕсли; 
		
		// --- 
		
		//Объект.Синхронизация.Сортировать("КлючСортировки Возр");
		
		// ---------------------------------------------------------------------------- 
		
		ТипыОбъектов.Очистить();
		
		ПЗ = _ПараметрыЗагрузки();
		Типы = ПЗ.Типы;
		СинхронизируемыеТипы = ПЗ.СинхронизируемыеТипы;
		
		Для каждого Стр Из СинхронизируемыеТипы Цикл
			
			Нстр = ТипыОбъектов.Добавить();
			Нстр.ИмяТипа = Типы.Получить(Строка(Стр.Ключ)).Синоним;
			Нстр.Источник_Тип = Стр.Ключ;
			
		КонецЦикла;
		
		_ОбновитьСостояниеСинхронизации();
		
		Возврат(_УФКС.Ответ());		
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОбновитьСостояниеСинхронизации(ТипОбъекта=Неопределено)
	// --- 
	
	// если передан тип, то обновляем только для заданного типа
	// иначе обновляем для всех типов
	
	Если ТипОбъекта = Неопределено Тогда
		
		ТЗТипов = ТипыОбъектов.Выгрузить(,"Источник_Тип");
		МассивТипов = ТЗТипов.ВыгрузитьКолонку("Источник_Тип");
		
	Иначе
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипОбъекта);
		
	КонецЕсли; 
	
	Для каждого ТипОбъекта Из МассивТипов Цикл
		
		// ищем несинхронизированные
		Отбор = _сф.ст_Создать("Источник_Тип,Синхронизировано");
		Отбор.Источник_Тип = ТипОбъекта;
		Отбор.Синхронизировано = Ложь;
		КоличествоНесинхронизированных = Объект.Синхронизация.НайтиСтроки(Отбор).Количество();
		СтрокаТипа = _сф.к_НайтиСтроку(ТипыОбъектов,_сф.ст_Отбор("Источник_Тип",ТипОбъекта));
		Если КоличествоНесинхронизированных <> 0 Тогда
			
			СтрокаТипа.Картинка = 0;
			
		Иначе
			
			СтрокаТипа.Картинка = 1;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПроверитьСинхронизацию()
	// --- 
	
	КоличествоНесинхронизированных = Объект.Синхронизация.НайтиСтроки(_сф.ст_Отбор("Синхронизировано",Ложь)).Количество();
	
	Если КоличествоНесинхронизированных = 0 Тогда
		
		Возврат(_УФКС.Ответ());
		
	Иначе
		
		Возврат(_УФКС.Ответ(1));
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьОбъекты()
	// --- 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ЗагрузитьОбъекты(_ПараметрыЗагрузки());
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	// --- 
	// перемещаем файл
	
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		КаталогПеремещения = _Настройка().Загрузка_КаталогДляУспешных;
		
	Иначе
		
		КаталогПеремещения = _Настройка().Загрузка_КаталогДляОшибочных;
		
	КонецЕсли; 
	
	// перемещаем
	Попытка
		
		ПереместитьФайл(ЗагружаемыйФайл,КаталогПеремещения+"\"+_сф.ф_КороткоеИмяФайла(ЗагружаемыйФайл));
		
	Исключение
		
		Сообщить("Ошибка перемещения файла """+ЗагружаемыйФайл+""" в папку """+КаталогПеремещения+"""");
		
	КонецПопытки;
	
	// --- 
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		Возврат(_УФКС.Ответ());
		
	Иначе
		
		Возврат(_УФКС.Ответ(1,"Ошибка загрузки: "+_УФКС.ПредставлениеОшибки(Ответ)));
		
	КонецЕсли; 
	
	// --- 
КонецФункции


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТипыОбъектовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТипыОбъектов.ТекущаяСтрока <> Неопределено Тогда
		
		ТипОбъекта = Элементы.ТипыОбъектов.ТекущиеДанные.Источник_Тип;
		Отбор = Новый Структура("Источник_Тип",ТипОбъекта);
		Элементы.Синхронизация.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		
		_ОбработатьАктивизациюТипа(ТипОбъекта);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьАктивизациюТипа(ТипОбъекта)
	// --- 
	
	Типы = _ПараметрыЗагрузки().Типы;
	ТекущийТип = Типы.Получить(Строка(ТипОбъекта));
	
	// смотрим на синхронизацию
	РазрешенаАвтоматическаяСинхронизация = (Найти(ТекущийТип.Синхронизация,"A") <> 0);
	РазрешенаРучнаяСинхронизация = (Найти(ТекущийТип.Синхронизация,"M") <> 0);
	// --- 
	Элементы.СинхронизацияСинхронизация_СоздатьОбъектСоответствия.Доступность = РазрешенаАвтоматическаяСинхронизация;
	Элементы.СинхронизацияСинхронизация_СоздатьОбъектыСоответствияДляКатегории.Доступность = РазрешенаАвтоматическаяСинхронизация;
	Элементы.СинхронизацияСинхронизация_ВыбратьСоответствие.Доступность = РазрешенаРучнаяСинхронизация;
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Синхронизация_СоздатьОбъектСоответствия(Команда)
	
	Если Элементы.Синхронизация.ТекущиеДанные <> Неопределено Тогда
		
		_СоздатьОбъектСоответствия(Элементы.Синхронизация.ТекущаяСтрока,Элементы.ТипыОбъектов.ТекущиеДанные.Источник_Тип);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _СоздатьОбъектСоответствия(ИдентификаторСтроки,ТипОбъкта=Неопределено)
	// --- 
	
	Если ТипЗнч(ИдентификаторСтроки) = Тип("Число") Тогда
		
		СинхроСтрока = Объект.Синхронизация.НайтиПоИдентификатору(ИдентификаторСтроки);
		
	Иначе
		
		СинхроСтрока = ИдентификаторСтроки;
		
	КонецЕсли; 
	
	СинхроСтрока.СозданиеНового = Истина;
	СинхроСтрока.Приемник_УИД = CW_Обмены.ПолучитьУИД(Неопределено);
	СинхроСтрока.Синхронизировано = Истина;
	СинхроСтрока.Приемник_Наименование = "< авто >";
	СинхроСтрока.НомерКартинки = 1;
	
	CW_Обмены.ЗаписатьСоответствиеВРегистр(_ПараметрыЗагрузки(),СинхроСтрока);
	
	Если ТипОбъкта <> Неопределено Тогда
		
		_ОбновитьСостояниеСинхронизации(ТипОбъкта);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ----------------------------------------------------------------------------  

&НаКлиенте
Процедура Синхронизация_СоздатьОбъектыСоответствияДляКатегории(Команда)
	
	Если Элементы.ТипыОбъектов.ТекущиеДанные <> Неопределено Тогда
		
		_СоздатьОбъектыСоответствия(Элементы.ТипыОбъектов.ТекущиеДанные.Источник_Тип);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _СоздатьОбъектыСоответствия(ТипОбъекта)
	// --- 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Источник_Тип",ТипОбъекта);
	Отбор.Вставить("Синхронизировано",Ложь);
	Мстр = Объект.Синхронизация.НайтиСтроки(Отбор);
	
	Если НЕ Мстр.Количество()=0 Тогда
		
		Для каждого СинхроСтрока Из Мстр Цикл
			
			_СоздатьОбъектСоответствия(СинхроСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	_ОбновитьСостояниеСинхронизации(ТипОбъекта);
	
	// --- 
КонецФункции

// ----------------------------------------------------------------------------  

&НаКлиенте
Процедура СинхронизацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// ... (тут надо увязать на выбор для несинхронизированных)
	
КонецПроцедуры

&НаКлиенте
Процедура Синхронизация_ВыбратьСоответствие(Команда)
	
	Если Элементы.ТипыОбъектов.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ТипОбъекта = Элементы.ТипыОбъектов.ТекущиеДанные.Источник_Тип;
	// --- 
	Ответ = _ПолучитьФормуВыбора(ТипОбъекта,Элементы.Синхронизация.ТекущаяСтрока);
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		Попытка
			
			ФормаВыбора = ПолучитьФорму(Ответ.ИмяФормы,_сф.ст_ПолучитьСвойство(Ответ,"ПараметрыФормы"));
			
		Исключение
		    
			_УФК.ВывестиПредупреждение(ОписаниеОшибки());
			
		КонецПопытки; 
		
		// ... (тут можно произвести установку параметров для толстых форм, тип формы в Ответ.ИмяТипа)
 		
		Результат = ФормаВыбора.ОткрытьМодально();
		Если Результат <> Неопределено Тогда
			
			Ответ = _УстановитьСоответствие(Элементы.Синхронизация.ТекущаяСтрока,Результат);
			Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
				
				_УФК.ВывестиПредупреждение("Ошибка: "+_УФКС.ПредставлениеОшибки(Ответ));
				
			КонецЕсли; 		
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьФормуВыбора(ТипОбъекта,ИдентификаторСтрокиСинхронизации)
	// --- 
		
	СФ = _УФКС.Ответ();
	// --- 
	СФ.Вставить("ИмяТипа",ТипОбъекта.Наименование);
	СМ = _ПараметрыЗагрузки().СоответствиеТипов.Получить(СФ.ИмяТипа);
	ИмяМетаданного = СМ.Имя;
	СФ.Вставить("ИмяФормы",ИмяМетаданного+".ФормаВыбора");
	// --- 
	ЕстьПараметры = Ложь;
	ПФ = Новый Структура;
	СинхроСтрока = Объект.Синхронизация.НайтиПоИдентификатору(ИдентификаторСтрокиСинхронизации);
	Если СинхроСтрока.Синхронизировано И НЕ СинхроСтрока.СозданиеНового Тогда
		
		ЕстьПараметры = Истина;
		ПФ.Вставить("ТекущаяСтрока",СинхроСтрока.Приемник_Объект);
		
	КонецЕсли; 
	// --- 
	Если СФ.ИмяТипа = "Справочник.Договоры" Тогда
		
		Ответ = _ДоработатьПараметрыФормыДляДоговора(ПФ,СинхроСтрока);
		Если _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			ЕстьПараметры = Истина;
			
		Иначе
			
			Возврат(_УФКС.Ответ(1,_УФКС.ПредставлениеОшибки(Ответ)));
			
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	Если ЕстьПараметры Тогда
		
		СФ.Вставить("ПараметрыФормы",ПФ);
		
	КонецЕсли; 
	// --- 
	Возврат(СФ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДоработатьПараметрыФормыДляДоговора(ПФ,СинхроСтрока)
	// --- 
	
	Если СинхроСтрока = Неопределено Тогда
		
		Возврат(_УФКС.Ответ(1,"Не найдена строка синхронизации"));
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	СПО = Новый Структура("Организация,Контрагент,Валюта,ВидДоговора");
	// --- 
	// необходимо получить прочитанный объект соответствия
	Идентификатор = ?(_ПараметрыЗагрузки().ИспользуетсяUID,СинхроСтрока.Источник_УИД,СинхроСтрока.Источник_СИ);
	СинхроСоответствие = ПолучитьИзВременногоХранилища(_ПараметрыЗагрузки().СинхроСоответствие);
	ХМЛОбъект = СинхроСоответствие.Получить(Строка(Идентификатор));
	Если ХМЛОбъект = Неопределено Тогда
		
		Возврат(_УФКС.Ответ(1,"Ошибка чтения объекта"));
		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	// проверяем организацию
	СтрокаСинхронизации = _сф.к_НайтиСтроку(Объект.Синхронизация,_сф.ст_Отбор("Источник_УИД",_ИдентификаторПоСтроке(ХМЛОбъект["Организация"])));
	Если СтрокаСинхронизации.Синхронизировано Тогда
		
		Если СтрокаСинхронизации.ОбъектЗаписан Тогда
			
			СПО.Организация = СтрокаСинхронизации.Приемник_Объект;
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(_УФКС.Ответ(1,"Сначала необходимо синхронизировать организацию """+Строка(СтрокаСинхронизации.Источник_Наименование)+""""));
		
	КонецЕсли; 
	
	// проверяем контрагента
	СтрокаСинхронизации = _сф.к_НайтиСтроку(Объект.Синхронизация,_сф.ст_Отбор("Источник_УИД",_ИдентификаторПоСтроке(ХМЛОбъект["Контрагент"])));
	Если СтрокаСинхронизации.Синхронизировано Тогда
		
		Если СтрокаСинхронизации.ОбъектЗаписан Тогда
			
			СПО.Контрагент = СтрокаСинхронизации.Приемник_Объект;
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(_УФКС.Ответ(1,"Сначала необходимо синхронизировать контрагента """+Строка(СтрокаСинхронизации.Источник_Наименование)+""""));
		
	КонецЕсли; 
	
	// проверяем валюту
	СтрокаСинхронизации = _сф.к_НайтиСтроку(Объект.Синхронизация,_сф.ст_Отбор("Источник_УИД",_ИдентификаторПоСтроке(ХМЛОбъект["Валюта"])));
	Если СтрокаСинхронизации.Синхронизировано Тогда
		
		Если СтрокаСинхронизации.ОбъектЗаписан Тогда
			
			СПО.Валюта = СтрокаСинхронизации.Приемник_Объект;
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(_УФКС.Ответ(1,"Сначала необходимо синхронизировать валюту """+Строка(СтрокаСинхронизации.Источник_Наименование)+""""));
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	ПФ.Вставить("Отбор",Новый Структура);
	ПФ.Отбор.Вставить("ВзаиморасчетыВУЕ",ХМЛОбъект["УсловныеЕдиницы"]);
	
	Если СПО.Организация <> Неопределено Тогда
		
		ПФ.Отбор.Вставить("Организация",СПО.Организация);
		
	КонецЕсли; 
	Если СПО.Контрагент <> Неопределено Тогда
		
		ПФ.Отбор.Вставить("Владелец",СПО.Контрагент);
		
	КонецЕсли;
	Если СПО.Валюта <> Неопределено Тогда
		
		ПФ.Отбор.Вставить("ВалютаДоговора",СПО.Валюта);
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция _ИдентификаторПоСтроке(СтрокаИдентификатора)
	// --- 
	
	Если _ПараметрыЗагрузки().ИспользуетсяUID Тогда
		
		Возврат(Новый УникальныйИдентификатор(СтрокаИдентификатора));
		
	Иначе
		
		Возврат(СтрокаИдентификатора);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция _УстановитьСоответствие(ИдентификаторСтрокиСинхронизации,СсылкаСоответствия)
	// --- 
	
	Попытка
		
		СинхроСтрока = Объект.Синхронизация.НайтиПоИдентификатору(ИдентификаторСтрокиСинхронизации);
		// --- 
		
		СинхроСтрока.Приемник_УИД = СсылкаСоответствия.УникальныйИдентификатор();
		СинхроСтрока.Приемник_Объект = СсылкаСоответствия;
		СинхроСтрока.Приемник_Наименование = Строка(СсылкаСоответствия);
		
		Ответ = CW_Обмены.ЗаписатьСоответствиеВРегистр(_ПараметрыЗагрузки(),СинхроСтрока);
		Если _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			СинхроСтрока.Синхронизировано = Истина;
			СинхроСтрока.СозданиеНового = Ложь;
			СинхроСтрока.НомерКартинки = 1;
			
			// --- 
			_ОбновитьСостояниеСинхронизации(СинхроСтрока.Источник_Тип);
			// --- 
			Возврат(_УФКС.Ответ());
			
		Иначе
			
			Возврат(_УФКС.Ответ(1,"Ошибка записи в регистр синхронизации: "+_УФКС.ПредставлениеОшибки(Ответ)));
			
		КонецЕсли; 
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки;
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Синхронизация_ОткрытьОбъект(Команда)
	
	Если Элементы.Синхронизация.ТекущаяСтрока <> Неопределено Тогда
		
		Ответ = _ПроверитьВозможностьОткрытияОбъекта(Элементы.Синхронизация.ТекущаяСтрока);
		Если _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			ПоказатьЗначение(,Ответ.Ссылка);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьВозможностьОткрытияОбъекта(ИдентификаторСтрокиСинхронизации)
	// --- 
	
	СинхроСтрока = Объект.Синхронизация.НайтиПоИдентификатору(ИдентификаторСтрокиСинхронизации);
	// --- 
	Если СинхроСтрока.Синхронизировано И НЕ СинхроСтрока.СозданиеНового Тогда
		
		Ответ = _УФКС.Ответ();
		Ответ.Вставить("Ссылка",СинхроСтрока.Приемник_Объект);
		Возврат(Ответ);
		
	Иначе
		
		Возврат(_УФКС.Ответ(1));
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Синхронизация_УдалитьСинхронизацию(Команда)
	
	Если Элементы.Синхронизация.ТекущиеДанные <> Неопределено Тогда
		
		Ответ = Вопрос("Вы уверены?", РежимДиалогаВопрос.ДаНет) ;
		Если Ответ=КодВозвратаДиалога.Да Тогда
			
			Ответ = _УдалитьСинхронизацию(Элементы.Синхронизация.ТекущаяСтрока);
			Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
				
				_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _УдалитьСинхронизацию(ИдентификаторСтрокиСинхронизации)
	// --- 
	
	Попытка
		
		СинхроСтрока = Объект.Синхронизация.НайтиПоИдентификатору(ИдентификаторСтрокиСинхронизации);
		// --- 
		
		СинхроСтрока.Приемник_УИД = CW_Обмены.ПолучитьУИД(Неопределено);
		СинхроСтрока.Приемник_Объект = Неопределено;
		СинхроСтрока.Приемник_Наименование = "";
		
		Ответ = CW_Обмены.ЗаписатьСоответствиеВРегистр(_ПараметрыЗагрузки(),СинхроСтрока);
		Если _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			СинхроСтрока.Синхронизировано = Ложь;
			СинхроСтрока.СозданиеНового = Ложь;
			СинхроСтрока.НомерКартинки = 0;
			
			// --- 
			_ОбновитьСостояниеСинхронизации(СинхроСтрока.Источник_Тип);
			// --- 
			Возврат(_УФКС.Ответ());
			
		Иначе
			
			Возврат(_УФКС.Ответ(1,"Ошибка записи в регистр синхронизации: "+_УФКС.ПредставлениеОшибки(Ответ)));
			
		КонецЕсли; 
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки;
	
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Синхронизация_ОткрытьРегистрСинхронизации(Команда)
	
	Отбор = Новый Структура("Источник_Идентификатор",Обмен);
	ПФ = Новый Структура("Отбор",Отбор);
	ФормаРегистра = ПолучитьФорму("РегистрСведений.CW_СинхронизацияОбъектов.ФормаСписка",ПФ);
	ФормаРегистра.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		
		ПоказатьЗначение(,Элементы.Объекты.ТекущиеДанные.ОбъектСоответствия);
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры



// ---
